
&НаКлиенте
АСИНХ Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	НазваниеТовара = Ждать ВвестиСтрокуАсинх("", "Введите название товара");
	
	Если ПроверитьСуществованиеТовара(НазваниеТовара) Тогда
		ТекстСообщения = СтрШаблон("Товар %1 найден!", НазваниеТовара);		
	Иначе	
		ТекстСообщения = СтрШаблон("Товар %1 не найден!", НазваниеТовара);
	КонецЕсли;
	
	Сообщить(ТекстСообщения);
КонецПроцедуры

Функция ПроверитьСуществованиеТовара(НазваниеТовара)
	ТаблицаТоваров = Новый ТаблицаЗначений();
	ТаблицаТоваров.Колонки.Добавить("Название");
	ТаблицаТоваров.Колонки.Добавить("Цена");
	
	СтрокаТовара = ТаблицаТоваров.Добавить();
	СтрокаТовара.Название = "Гитара";
	СтрокаТовара.Цена = 100;
	
	СтрокаТовара = ТаблицаТоваров.Добавить();
	СтрокаТовара.Название = "Микро";
	СтрокаТовара.Цена = 59;
	
	ТоварСуществует = Справочники.Товары.ПроверитьСуществованиеТовара(НазваниеТовара);
	Возврат ТоварСуществует;
КонецФункции